xpl/research/research-wsd-enum/exploit.py

#!/usr/bin/env python3
"""
WSD (Web Services on Devices) Printer Discovery & Enumeration

Uses WS-Discovery (UDP multicast / unicast on port 3702) to discover printers and MFPs on the local network. Then queries WSD SOAP endpoints (port 5357 TCP) to extract device metadata including model, serial, capabilities.

Author: André Henrique (@mrhenrike) | União Geek
"""
from __future__ import annotations

from typing import Any, Dict

METADATA: Dict[str, Any] = {
    "id":       "research/research-wsd-enum",
    "title":    "WSD (Web Services on Devices) Printer Discovery & Enumeration",
    "source":   "research",
    "cve":      "WSD-ENUM-001",
    "cvss":     5.3,
    "severity": "medium",
    "vendor":   "Generic MFP",
    "protocol": "wsd",
    "port":     3702,
    "tags":     ["enumeration", "wsd", "discovery", "fingerprint", "mfp"],
    "author":   "Andre Henrique (@mrhenrike)",
}

import re
import socket
import struct
import uuid
from typing import Any, Dict, List, Optional

_WS_DISCOVERY_PROBE = (
    '<?xml version="1.0" encoding="utf-8"?>'
    '<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"'
    ' xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"'
    ' xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery">'
    '<soap:Header>'
    '<wsa:To>urn:schemas-xmlsoap-org:ws:2005:04:discovery</wsa:To>'
    '<wsa:Action>http://schemas.xmlsoap.org/ws/2005/04/discovery/Probe</wsa:Action>'
    '<wsa:MessageID>urn:uuid:{msg_id}</wsa:MessageID>'
    '</soap:Header>'
    '<soap:Body>'
    '<wsd:Probe><wsd:Types>wsdp:Device</wsd:Types></wsd:Probe>'
    '</soap:Body>'
    '</soap:Envelope>'
)

_WSD_GET_META = (
    'POST /wsd HTTP/1.1\r\nHost: {host}:{port}\r\n'
    'Content-Type: application/soap+xml; charset=utf-8\r\n'
    'Content-Length: {clen}\r\n\r\n{body}'
)

_WSD_META_BODY = (
    '<?xml version="1.0" encoding="utf-8"?>'
    '<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"'
    ' xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"'
    ' xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex">'
    '<soap:Header>'
    '<wsa:To>http://{host}:{port}/wsd</wsa:To>'
    '<wsa:Action>http://schemas.xmlsoap.org/ws/2004/09/transfer/Get</wsa:Action>'
    '<wsa:MessageID>urn:uuid:{msg_id}</wsa:MessageID>'
    '<wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo>'
    '</soap:Header>'
    '<soap:Body><wsx:GetMetadata/></soap:Body>'
    '</soap:Envelope>'
)

def _probe_wsd(host: str, port: int = 3702, timeout: float = 3.0) -> str:
    msg = _WS_DISCOVERY_PROBE.format(msg_id=str(uuid.uuid4()))
    try:
        sock = socket.socket(socket.AF_INET, socket.SOCK_DGRAM)
        sock.settimeout(timeout)
        sock.sendto(msg.encode(), (host, port))
        try:
            data, _ = sock.recvfrom(8192)
            return data.decode("utf-8", errors="replace")
        except socket.timeout:
            return ""
    except Exception:
        return ""
    finally:
        sock.close()

def _get_metadata(host: str, port: int = 5357, timeout: float = 5.0) -> str:
    body = _WSD_META_BODY.format(host=host, port=port, msg_id=str(uuid.uuid4()))
    req = _WSD_GET_META.format(host=host, port=port, clen=len(body), body=body)
    try:
        s = socket.create_connection((host, port), timeout=timeout)
        s.sendall(req.encode())
        s.settimeout(3)
        resp = b""
        try:
            while True:
                c = s.recv(4096)
                if not c:
                    break
                resp += c
        except socket.timeout:
            pass
        s.close()
        return resp.decode("utf-8", errors="replace")
    except Exception:
        return ""

def _extract_tags(xml: str, tag: str) -> List[str]:
    return re.findall(rf"<[^>]*{tag}[^>]*>([^<]+)<", xml)

def check(host: str, port: int = 3702, **kwargs: Any) -> bool:
    resp = _probe_wsd(host, port)
    return bool(resp and ("ProbeMatches" in resp or "Endpoint" in resp))

def run(host: str, port: int = 3702, wsd_port: int = 5357,
        dry_run: bool = False, **kwargs: Any) -> Dict[str, Any]:
    result: Dict[str, Any] = {
        "host": host, "port": port, "wsd_port": wsd_port,
        "success": False, "device_info": {}, "message": "",
    }
    if dry_run:
        result["message"] = "dry_run: would probe WSD on UDP 3702 and TCP 5357"
        return result

    probe_resp = _probe_wsd(host, port)
    if probe_resp:
        result["probe_response"] = probe_resp.strip()[:500]
        result["success"] = True

    meta = _get_metadata(host, wsd_port)
    if meta:
        info: Dict[str, str] = {}
        for tag in ["FriendlyName", "Manufacturer", "ModelName", "ModelNumber",
                     "SerialNumber", "FirmwareVersion", "PresentationUrl"]:
            vals = _extract_tags(meta, tag)
            if vals:
                info[tag] = vals[0].strip()
        result["device_info"] = info
        result["metadata_raw"] = meta.strip()[:600]
        result["success"] = True
        result["message"] = "WSD device enumerated: %s" % str(info.get("ModelName", "unknown"))
    else:
        result["message"] = "WSD probe sent; no metadata endpoint response"
    return result

